# 1) У вас є рядок my_string = '0123456789'.
# Згенерувати цілі числа (тип int) від 0 до 99 та роздрукувати їх.
# Завдання потрібно виконати через цикл у циклі (див. приклад нижче) та наведення типів.
# Генерування через range або інші "фішки" можна в якості альтернативного вирішення, але спершу через цикл у циклі))
#
#
# ###################### Приклад ###############################
#
# my_string_1 = "12"
# my_string_2 = "34"
# for symb_1 in my_string_1:      # перебирається всі елементи з my_string_2 для елемента "1" з my_string_1
#     for symb_2 in my_string_2:  # перебирається всі елементи з my_string_2 для елемента "2" з my_string_1
#         print(symb_1 + symb_2)  # складає символи з першої та другої строки

my_string = '0123456789'

for x in my_string:
    for y in my_string:
        print(int(x+y))
