# 1. Дано рядок.
# my_str = "qwert5tse"
#      a. виведіть третій символ цього рядка.
# print(my_str[2])
#      b. виведіть передостанній символ цього рядка.
# print(my_str[-2])
#      c. виведіть перші п'ять символів цього рядка.
# print(my_str[:5])
#      d. виведіть весь рядок, крім двох останніх символів.
# print(my_str[:len(my_str)-2])
#      e. виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться
#      починаючи з першого).
# print(my_str[::2])# символы с четными индексами (0,2,4,6...) будут иметь нечетный порядок в строке
#      f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
# print(my_str[1::2])# символы с нечетными индексами (1,3,5,7...) будут иметь четный порядок в строке
#      g. виведіть усі символи у зворотному порядку.
# print(my_str[::-1])
#      h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
# print(my_str[::-2])
#      i. виведіть довжину цього рядка.
# print(len(my_str))
#
#
# 2. Дано рядок, що складається зі слів, розділених пробілами. Визначте, скільки у ній слів. Використовуйте для вирішення
# завдання функцію `count`

# word = "Hasta la vista, baby"
# print(word.count(" ")+1)# не лучшее решение на практике, т.к. юзер может не поставить пробел после запятой, но в условии
# задания сказано, что разделить слова пробелами, так что ок :)

# 3. Користувач вводить окремо рядок `s` та один символ `ch`. Необхідно здійснити пошук у рядку `s` всіх символів `ch`.
# Для вирішення можна використовувати тільки функцію `find` (rfind), оператори `if` та `for` (while).

s = input("Enter a string: ")
ch = input("Enter one symbol: ")

# Вариант 1:
# for m in s:
#     if m == ch:
#         print(m)

# Вариант 2:
# sum_matches = s.count(ch)
# print(sum_matches)

# Вариант 3:
# matches = []
#
# for symbol in s:
#     if symbol == ch:
#         matches.append(symbol)
#
# if len(matches) > 0:
#     print(f"Найдено '{len(matches)}' совпадений")
# else:
#     print("Совпадений не найдено")

# 4. Дано рядок. Замініть у цьому рядку всі появи літери `h` на літеру `H`, крім першого та останнього входження.

# var_str = "hahaha hoolahoop haha"
#
# value1 = var_str.find("h")
# value2 = var_str.rfind("h")
#
# var_str = var_str[:value1+1] + var_str[value1+1:value2].replace('h', 'H') + var_str[value2:]
# print(var_str)